{
  "data": [
    {
      "text": "Thirty-two years together and you still take my breath away. Happy Valentine’s Day, @MichelleObama! https://t.co/wiIJ0kstRm",
      "edit_history_tweet_ids": [
        "1890404640161775623"
      ],
      "id": "1890404640161775623"
    },
    {
      "text": "Second time’s the charm. Congrats to the @Eagles, Jalen Hurts, Saquon Barkley, Nick Sirianni and an outstanding defense for winning one for Philly. You earned it! https://t.co/UTI8b0MTX2",
      "edit_history_tweet_ids": [
        "1888792624015798464"
      ],
      "id": "1888792624015798464"
    },
    {
      "text": "USAID has been fighting disease, feeding children, and promoting goodwill around the world for six decades. As this article makes clear, dismantling this agency would be a profound foreign policy mistake - one that Congress should resist. https://t.co/MSsgZ82QbX",
      "edit_history_tweet_ids": [
        "1887675301678678455"
      ],
      "id": "1887675301678678455"
    },
    {
      "text": "Congrats to our new DNC chair, Ken Martin. Ken has done outstanding work in Minnesota, and will bring that same energy and drive to this new role. Together, we need to build a bold, responsive Democratic Party that can tell a compelling story about who we’re fighting for and… https://t.co/yFGwg4uOhl https://t.co/0IK7DhBXxc",
      "edit_history_tweet_ids": [
        "1885768644946444550"
      ],
      "id": "1885768644946444550"
    },
    {
      "text": "From our earliest days, Black history has always been American history – and Black folks have profoundly shaped our American culture through music, art, literature, sports, and beyond. One month a year is not sufficient to celebrate the power of the movements and the people who… https://t.co/iIbsvguwLm https://t.co/N3P2RhCs47",
      "edit_history_tweet_ids": [
        "1885712803534700566"
      ],
      "id": "1885712803534700566"
    },
    {
      "text": "Our hearts break for the families who lost loved ones in the tragic plane and helicopter crash at DCA. Michelle and I send our prayers and condolences to everyone who is mourning today, and we’re grateful to the first responders who are doing everything they can to help under… https://t.co/nQ5fYdaANl",
      "edit_history_tweet_ids": [
        "1884972926635561231"
      ],
      "id": "1884972926635561231"
    },
    {
      "text": "RT @ObamaFoundation: EXCITING NEWS: Applications for the Obama-Chesky Voyager Scholarship are officially OPEN! 🌍✨\n\nWe need young leaders wh…",
      "edit_history_tweet_ids": [
        "1882819533905551742"
      ],
      "id": "1882819533905551742"
    },
    {
      "text": "RT @ObamaFoundation: As California battles ongoing wildfires, we're grateful for people like Royal Ramey — an #ObamaLeader — who is empower…",
      "edit_history_tweet_ids": [
        "1881825185671917936"
      ],
      "id": "1881825185671917936"
    },
    {
      "text": "Cecile Richards dedicated her life to protecting and expanding women’s rights. She never wavered in her commitment to ensuring that women had access to the reproductive health care they needed, and her leadership at Planned Parenthood led to the inclusion of important healthcare… https://t.co/K9HDUkokKY",
      "edit_history_tweet_ids": [
        "1881455499075625245"
      ],
      "id": "1881455499075625245"
    },
    {
      "text": "Through struggle and discipline, persistence and faith, Dr. Martin Luther King, Jr. helped move this country forward. As we honor his legacy today, let’s remember the lesson he taught us: that even in the face of impossible odds, people who love this country can help change it.… https://t.co/3YZmFOK21n",
      "edit_history_tweet_ids": [
        "1881326129648140734"
      ],
      "id": "1881326129648140734"
    }
  ],
  "meta": {
    "result_count": 10,
    "newest_id": "1890404640161775623",
    "oldest_id": "1881326129648140734",
    "next_token": "7140dibdnow9c7btw4b38iksmvtaiqeuwf9ghn6ks2blg"
  }
}