{
  "data": [
    {
      "text": "In January, we saw historic damage in Altadena, Pacific Palisades, and throughout Los Angeles due to wildfires. These blazes — made worse by the climate crisis — devastated communities.\n\nAt the same time, we also witnessed the best of who we are as Americans, including neighbors… https://t.co/0Mk6ceUjFE https://t.co/rZ4ZlKBfZu",
      "edit_history_tweet_ids": [
        "1887667957108465685"
      ],
      "id": "1887667957108465685"
    },
    {
      "text": "Black history is American history.\n\nOur music, art, sports, literature, leadership, resistance, and resilience are fundamental to the fabric of our nation and the progress that we fight for.\n\nThis month and every month, we celebrate Black history, and we continue our fight for… https://t.co/4gvyL4yt0b",
      "edit_history_tweet_ids": [
        "1885791986545819739"
      ],
      "id": "1885791986545819739"
    },
    {
      "text": "Doug and I are full of joy and relief to see American Keith Siegel reunited with his family. We join all those around the world who are celebrating his release and the release of other hostages in recent days and weeks. We continue to pray for the Americans and all of the… https://t.co/5WxCHcknHp",
      "edit_history_tweet_ids": [
        "1885731855627948482"
      ],
      "id": "1885731855627948482"
    },
    {
      "text": "Thank you to the artists who gathered tonight in Los Angeles for the FireAid Concert. Angelenos will continue to stand together to support those impacted by the wildfires and show gratitude for the first responders who help keep our communities safe.\n\nhttps://t.co/AeAfLU0IgX https://t.co/KYf7GV7eNh",
      "edit_history_tweet_ids": [
        "1885202611173015954"
      ],
      "id": "1885202611173015954"
    },
    {
      "text": "Doug and I are heartbroken by the tragic plane and helicopter crash at DCA last night. Our prayers are with the victims and all those who loved them, and we are grateful for the first responders who are undertaking heroic search and recovery efforts.",
      "edit_history_tweet_ids": [
        "1885017762524811314"
      ],
      "id": "1885017762524811314"
    },
    {
      "text": "In the wake of the wildfires in Los Angeles, we have seen heroic acts from our firefighters, first responders, and Angelenos taking extraordinary action to help neighbors and strangers in need. Yesterday, I stopped by to thank volunteers and firefighters for everything they do. https://t.co/UPiMzn39Ij",
      "edit_history_tweet_ids": [
        "1881866952538485141"
      ],
      "id": "1881866952538485141"
    },
    {
      "text": "Cecile Richards was a fighter and a force to be reckoned with.\n\nOver the decades I have known her, we stood shoulder to shoulder in many battles. Cecile led with heart, fearlessness, and courage on the frontlines of the fight for women's rights and the dignity of every woman to… https://t.co/rnmUVjYFCx",
      "edit_history_tweet_ids": [
        "1881838000725758208"
      ],
      "id": "1881838000725758208"
    },
    {
      "text": "It has been the honor of my lifetime to serve as your Vice President. Stay connected with me at https://t.co/c9mtidhoc8. https://t.co/WwUMm6WmMP",
      "edit_history_tweet_ids": [
        "1881489926589653255"
      ],
      "id": "1881489926589653255"
    },
    {
      "text": "RT @VP: Over the last seven days, communities in Southern California have experienced horrific loss due to wildfires. President Biden and I…",
      "edit_history_tweet_ids": [
        "1879196601815884109"
      ],
      "id": "1879196601815884109"
    },
    {
      "text": "RT @VP: From our heroic first responders to the neighbors who are helping each other, Californians are stepping up and showing the best of…",
      "edit_history_tweet_ids": [
        "1878225785581863155"
      ],
      "id": "1878225785581863155"
    }
  ],
  "meta": {
    "next_token": "7140dibdnow9c7btw4b2trvmypyh52v7hgmu8ar574sol",
    "result_count": 10,
    "newest_id": "1887667957108465685",
    "oldest_id": "1878225785581863155"
  }
}